{
  "base_model_name_or_path": "meta-llama/Llama-3.2-1B",
  "bias": "none",
  "fan_in_fan_out": false,
  "gating": "Dense",
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 32.0,
  "lora_dropout": 0.1,
  "modules_to_save": null,
  "num_moe": 8,
  "peft_type": "MOELORA",
  "r": 32,
  "revision": null,
  "target_modules": [
    "q_proj",
    "v_proj"
  ],
  "task_type": "CAUSAL_LM"
}